Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t
Serialization structure for AnalysisRestraint.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.ReleaseType
Release type

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UxType
Restraint type for Ux.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UyType
Restraint type for Uy.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UzType
Restraint type for Uz.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RxType
Restraint type for Rx.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RyType
Restraint type for Ry.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RzType
Restraint type for Rz.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UxSpring
Ux [N/mm].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UySpring
Uy [N/mm].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.UzSpring
Uz [N/mm].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RxSpring
Rx [Nmm/rad].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RySpring
Ry [Nmm/rad].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.RzSpring
Rz [Nmm/rad].

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.Supported
Supported.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.LocalX
Local X.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.LocalY
Local Y.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.ToStruct(Tekla.Structures.Analysis.AnalysisRestraintData)
AnalysisRestraintData to dotAnalysisRestraintData.
P: P.

Tekla.Structures.AnalysisInternal.dotAnalysisRestraintData_t.FromStruct(Tekla.Structures.Analysis.AnalysisRestraintData)
dotAnalysisRestraintData to AnalysisRestraintData.
P: P.